app/controllers/ideas_controller.rb

SELECT * FROM `ideas` WHERE (`ideas`.`id` = 1)
---
  def show
    @idea = Idea.find(params[:id])

SELECT * FROM "ideas" WHERE ("ideas"."id" = 3)
---
  def edit
    @idea = Idea.find(params[:id])

INSERT INTO "ideas" ("name", "updated_at", "initiator", "desc", "created_at") VALUES('Growjects', '2008-12-07 15:47:16', 1, 'Web Application to get your ideas growing', '2008-12-07 15:47:16')
---
  def create
    @idea = Idea.new(params[:idea])

    respond_to do |format|
      if @idea.save