app/controllers/profiles_controller.rb

SELECT * FROM "profiles" WHERE ("profiles"."id" = 4)
---
  def index
    @profiles = Profile.find(:all)

SELECT * FROM `profiles` WHERE (`profiles`.`id` = 1)
---
  def show
    @profile = Profile.find(params[:id])

SELECT * FROM "profiles" WHERE ("profiles"."id" = 12)
---
  def edit
    @profile = Profile.find(params[:id])

INSERT INTO "profiles" ("updated_at", "firstname", "lastname", "additional_infos", "avatar", "user_id", "created_at") VALUES('2008-12-07 16:48:18', 'Michael', 'Fuchs', 'omfg lol', 'ava.gif', NULL, '2008-12-07 16:48:18')
---
  def create
    @profile = Profile.new(params[:profile])
    @profile.user_id = @current_user.id
    respond_to do |format|
      if @profile.save

SELECT * FROM "profiles" WHERE ("profiles"."id" = 4)
UPDATE "profiles" SET "lastname" = 'Testlastname', "firstname" = 'Testname', "avatar" = 'jpg.gif', "additional_infos" = 'heya', "updated_at" = '2008-12-07 18:11:05' WHERE "id" = 4
---
  def update
    @profile = Profile.find(params[:id])

    respond_to do |format|
      if @profile.update_attributes(params[:profile])

SELECT * FROM "profiles" WHERE ("profiles"."id" = 1)
DELETE FROM "profiles" WHERE "id" = 1
---
  def destroy
    @profile = Profile.find(params[:id])
    @profile.destroy