app/controllers/users_controller.rb

  def index
    @users = User.find(:all)
---
SELECT * FROM "users" WHERE ("users"."id" = 7) LIMIT 1

  def create
    @user = User.new(params[:user])
    @last_id_usr = User.find(:first, :order => 'id DESC')
    @user.id = @last_id_usr.id + 1
    prof_id = new_profile(session[:user])
    @user.profile_id = prof_id
    if @user.save
---
SELECT * FROM "users" WHERE ("users"."id" = 7) LIMIT 1
INSERT INTO "profiles" ("updated_at", "firstname", "lastname", "id", "additional_infos", "avatar", "user_id", "created_at") VALUES('2008-12-08 18:47:06', NULL, NULL, 12, NULL, NULL, 39, '2008-12-08 18:47:06')
INSERT INTO "users" ("salt", "updated_at", "nick", "enc_pwd", "email", "created_at", "profile_id") VALUES('3be42f3ceb45ca579d20368b501e4f3cc590b259', '2008-12-07 17:55:40', 'test', '08461baa872a508600d743332f2ff9ae89dfbaf7', 'test@growject.com', '2008-12-07 17:55:40', NULL)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 10) LIMIT 1
UPDATE "users" SET "nick" = 'sd', "updated_at" = '2008-12-07 16:20:51' WHERE "id" = 10

  def destroy
    @user = User.find(params[:id])
    @profile = Profile.find_by_user_id(params[:id])
    @profile.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 31) LIMIT 1
SELECT * FROM "profiles" WHERE ("profiles"."user_id" = '40') LIMIT 1
DELETE FROM "profiles" WHERE "id" = 16
DELETE FROM "users" WHERE "id" = 8